/* No comment provided by engineer. */
"About Verbatim Solutions" = "Über Verbatim Solutions";

/* No comment provided by engineer. */
"Verbi™ powered by Verbatim Solutions" = "Verbi™ von Verbatim Solutions";

/* No comment provided by engineer. */
"Tap here to begin typing.." = "Hier tippen, um mit der Eingabe zu beginnen";

/* No comment provided by engineer. */
"All translation history has been cleared." = "Der gesamte Übersetzungsverlauf wurde gelöscht.";

/* No comment provided by engineer. */
"Are you sure you want to clear all translation history?  Your previous translations will not show up as suggestions anymore." = "Soll der gesamte Übersetzungsverlauf wirklich gelöscht werden? Ihre vorherigen Übersetzungen werden dann nicht mehr als Vorschläge angezeigt.";

/* No comment provided by engineer. */
"Cancel" = "Abbrechen";

/* No comment provided by engineer. */
"Clear" = "Löschen";

/* No comment provided by engineer. */
"Clear Translation History" = "Übersetzungsverlauf löschen";

/* No comment provided by engineer. */
"Done" = "Fertig";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Professional Quote" = "Professionelles Angebot";

/* No comment provided by engineer. */
"Request Professional Quote" = "Profesionelles Angebot anfordern";

/* No comment provided by engineer. */
"Submitting.." = "Sende…";

/* No comment provided by engineer. */
"Translating.." = "Übersetze";

/* No comment provided by engineer. */
"Verbi™ is powered by Verbatim Solutions, a leading professional translation services provider.  Verbi™ provides you quick machine translations and is not a substitute for certified, professional translation services.  For a professional translation provided by one of our certified translators please contact us at" = "Verbi™ wird von Verbatim Solutions angeboten, einem führenden und professionellen Anbieter für Übersetzungsdienstleistungen. Verbi™ stellt Ihnen auf schnelle Weise Maschinenübersetzungen bereit und ist kein Ersatz für zertifizierte, professionelle Übersetzungsdienstleistungen. Für eine fachlich korrekte Übersetzung durch einen unserer zertifizierten Übersetzer kontaktieren Sie uns bitte unter";

/* No comment provided by engineer. */
"Mail:" = "E-Mail:";

/* No comment provided by engineer. */
"Call:" = "Telefon:";

/* No comment provided by engineer. */
"Online:" = "Online:";

/* No comment provided by engineer. */
"Verbi™ Translate" = "Verbi™ Translate";

/* No comment provided by engineer. */
"We're sorry, an error has occurred.  Please try again." = "Es ist leider ein Fehler aufgetreten. Bitte versuchen Sie es noch einmal.";

/* No comment provided by engineer. */
"An internet connection is required to continue." = "An internet connection is required to continue.";

/* No comment provided by engineer. */
"We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install." = "We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install.";

/* No comment provided by engineer. */
"Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install." = "Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install.";